Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.influxdb.helm_release.influxdb must be replaced
-/+ resource "helm_release" "influxdb" {
      ~ id                         = "influxdb" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "2.7.4"
              - chart          = "influxdb2"
              - first_deployed = 1738643058
              - last_deployed  = 1738643058
              - name           = "influxdb"
              - namespace      = "influxdb"
              - notes          = <<-EOT
                    InfluxDB 2 is deployed as a StatefulSet on your cluster.
                    
                    You can access it by using the service name: influxdb-influxdb2
                    
                    To retrieve the password for the 'admin' user:
                    
                      echo $(kubectl get secret influxdb-influxdb2-auth -o "jsonpath={.data['admin-password']}" --namespace influxdb | base64 --decode)
                    
                    Note: with enabled persistence, admin password is only set once during the initial deployment. The password is not changed when InfluxDB 2 is re-deployed with different password.
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - adminUser        = {
                          - bucket           = "minimal"
                          - organization     = "goboolean"
                          - password         = "dfjInwr231-SUD83rbn"
                          - retention_policy = "0s"
                          - token            = ""
                          - user             = "admin"
                        }
                      - affinity         = {}
                      - env              = {}
                      - fullnameOverride = ""
                      - image            = {
                          - pullPolicy = "IfNotPresent"
                          - repository = "influxdb"
                          - tag        = "2.7.4-alpine"
                        }
                      - ingress          = {
                          - annotations = {}
                          - enabled     = false
                          - hostname    = "influxdb.foobar.com"
                          - path        = "/"
                          - tls         = false
                        }
                      - initScripts      = {
                          - enabled = false
                          - scripts = {
                              - "init.sh" = <<-EOT
                                    #!/bin/bash
                                    influx apply --force yes -u https://raw.githubusercontent.com/influxdata/community-templates/master/influxdb2_operational_monitoring/influxdb2_operational_monitoring.yml
                                EOT
                            }
                        }
                      - livenessProbe    = {}
                      - nameOverride     = ""
                      - nodeSelector     = {}
                      - pdb              = {
                          - create       = true
                          - minAvailable = 1
                        }
                      - persistence      = {
                          - accessMode = "ReadWriteOnce"
                          - enabled    = true
                          - mountPath  = "/var/lib/influxdb2"
                          - size       = "50Gi"
                          - subPath    = ""
                        }
                      - podAnnotations   = {}
                      - podLabels        = {}
                      - readinessProbe   = {}
                      - resources        = {}
                      - securityContext  = {}
                      - service          = {
                          - annotations = {}
                          - labels      = {}
                          - port        = 80
                          - portName    = "http"
                          - targetPort  = 8086
                          - type        = "ClusterIP"
                        }
                      - serviceAccount   = {
                          - annotations = {}
                          - create      = true
                          - name        = null
                        }
                      - startupProbe     = {
                          - enabled = false
                        }
                      - tolerations      = []
                    }
                )
              - version        = "2.1.2"
            },
        ] -> (known after apply)
        name                       = "influxdb"
      ~ namespace                  = "influxdb" -> "influxdata" # forces replacement
        # (26 unchanged attributes hidden)
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.influxdata will be created
+ resource "kubernetes_namespace" "influxdata" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "influxdata"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.influxdb will be destroyed
  # (because kubernetes_namespace.influxdb is not in configuration)
- resource "kubernetes_namespace" "influxdb" {
      - id                               = "influxdb" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - generation       = 0 -> null
          - name             = "influxdb" -> null
          - resource_version = "8361432" -> null
          - uid              = "eff2dbb3-3ed6-4e12-babb-8631563f18e4" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 2 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
